# St7SetFaceLighting

Sets the state of the Lighting options for face rendering.

long St7SetFaceLighting(long uID, bool FillLighting, bool LineLighting)
Input Parameters
uID
Strand7 model file ID.
FillLighting
The lighting option for the face fill; either True or False.
LineLighting
The lighting option for the face outlines; either True or False.